USE PharmDB;

INSERT INTO 
	cities (name)
VALUES 
	('Хабаровск'),
	('Владивосток'),
	('Благовещенск');

INSERT INTO 
	drugstores (name, address, city_id)
VALUES 
	('Аптека №1', 'ул. Карла Маркса, 1', 1),
	('Аптека №2', 'ул. Ленина, 2', 1),
	('Аптека №3', 'пр. Победы, 3', 1),
	('Аптека №4', 'ул. Карла Маркса, 15', 1),
	('Аптека №5', 'ул. Комсомольская, 5', 2),
	('Аптека №6', 'ул. Большая, 6', 2),
	('Аптека №7', 'ул. Ленина, 22', 3);

INSERT INTO 
	cashdesk (number, description, drugstore_id)
VALUES 
	(1, 'касса 1', 1),
	(2, 'касса 2', 1),
	(3, 'рецептура 1', 1),
	(1, 'касса 1', 2),
	(2, 'касса 2', 2),
	(3, 'касса 3', 2),
	(1, 'рецептура 1', 3),
	(1, 'касса 1', 4),
	(2, 'касса 2', 4),
	(1, 'касса 1', 5),
	(2, 'касса 2', 5),
	(3, 'рецептура 1', 5),
	(4, 'рецептура 2', 5),
	(5, 'рецептура 3', 5),
	(1, 'касса 1', 6),
	(1, 'касса 1', 7),
	(2, 'касса 2', 7),
	(2, 'касса 1', 7),
	(3, 'касса 2', 7),
	(4, 'касса 1', 7),
	(5, 'касса 2', 7);